app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.user = current_user
    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "asdfdf"], ["user_id", 1], ["created_at", "2018-03-27 01:58:09.473383"], ["updated_at", "2018-03-27 01:58:09.473383"]]